Revit 2025 API
BracePlanRepresentation Enumeration
 The possible representations for braces in plan views.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BracePlanRepresentation
Public Enumeration BracePlanRepresentation
public enum class BracePlanRepresentation
type BracePlanRepresentation
Members
Member name | Value | Description
ParallelLine | 1 |  Braces are represented by a parallel line.
LineWithAngle | 2 |  Braces are represented by a line with angle.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace